<x-guest-layout>
    <div>

        <div class="hidden">
            <div id="logo-theme">
            </div>
        </div>

    </div>
    <div class="min-h-screen flex flex-col items-center">
        <div class="w-full minimal:p-4 tablet:p-10">
            <!-- Heading -->
            <h3 class="tablet:text-4xl minimal:text-2xl font-big tracking-tight text-milano">Пользовательское соглашение</h3>
            <!-- Content -->
            <div class="tablet:pb-10 minimal:pb-4 pt-4">
                <h1 class="tablet:text-2xl minimal:text-xl text-coffee font-big">
                    Соглашение в отношении пользования
                </h1>
            </div>
            <div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">1. Общие положения</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="tablet:text-xl minimal:text-lg text-coffee font-base pb-2">
                            Данное Пользовательское соглашение (далее – "Соглашение") представляет собой юридически обязывающий документ,
                            определяющий условия использования вами (далее – "Пользователь") интернет-сайта "Грузомагистр" (далее – "Сайт").
                            Пожалуйста, внимательно ознакомьтесь с содержанием настоящего Соглашения перед использованием Сайта.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            1.1. Сайт "Грузомагистр" является виртуальной платформой, разработанной в рамках учебного проекта
                            и представляет собой фиктивное веб-приложение, созданное для обучения и
                            демонстрации возможностей информационных систем в области грузоперевозок.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            1.2. Пользователь при использовании Сайта подтверждает свое согласие с условиями настоящего Соглашения,
                            а также соблюдение всех применимых законов и правил, регулирующих использование интернет-ресурсов.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            Стороны настоящим Соглашением осознанно понимают, что Сайт не является грузоперевозчиком
                            и не осуществляет самостоятельно перевозку грузов. Сайт представляет собой лишь информационную платформу,
                            предназначенную для сведения взаимодействия Заказчиков (Пользователей)
                            с Перевозчиками (Пользователями).
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">2. Права и обязанности Пользователя</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            2.1. Пользователь обязуется использовать Сайт и его функционал исключительно в образовательных целях,
                            а также в соответствии с целями и задачами проекта "Грузомагистр".
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            2.2. Пользователь несет ответственность за все свои действия, совершаемые при использовании Сайта,
                            в том числе за размещение информации, комментариев и другого контента, который может нарушать права
                            третьих лиц или противоречить действующему законодательству.
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">3. Отказ от ответственности</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            3.1. Администрация Сайта "Грузомагистр" не несет ответственности за любой ущерб или убытки,
                            возникшие в результате использования или невозможности использования Сайта, включая, но не ограничиваясь,
                            прямыми, косвенными, случайными, непредвиденными убытками или потерей доходов.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            3.2. Сайт "Грузомагистр" предоставляется "как есть", без каких-либо гарантий, явно выраженных
                            или предполагаемых, включая гарантии товарной пригодности, соответствия конкретным целям и безопасности.
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">4. Изменения и дополнения</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            4.1. Администрация Сайта оставляет за собой право в любое время вносить изменения и
                            дополнения в настоящее Пользовательское соглашение без предварительного уведомления Пользователей.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            4.2. Продолжение использования Сайта Пользователем после внесения изменений
                            и дополнений в настоящее Соглашение означает его согласие с такими изменениями и дополнениями.
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">5. Соглашение с ценовой политикой</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            5.1. Потенциальный грузоперевозчик с целью регистрации на портале "Грузомагистр" и оказания услуг по перевозке на портале, заключает соглашение
                            с компанией "Грузомагистр" об абонентской плате на бумажном носителе.
                            Контакты для связи размещены на странице Контакты.
                            В случае отсутствия такового соглашения Администратор сайта удаляет учетную запись потенциального перевозчика на портале.
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big">6. Заключительные положения</h2>
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            5.1. Настоящее Пользовательское соглашение является юридически обязывающим документом
                            и регулирует отношения между Пользователем и Сайтом "Грузомагистр".
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            5.2. Все споры и разногласия, возникающие в связи с исполнением настоящего Соглашения,
                            подлежат разрешению в соответствии с действующим законодательством.
                        </h2>
                    </div>
                </div>
                <div class="pb-10">
                    <div class="tablet:ps-10 minimal:ps-0 pt-4">
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            Пользовательское соглашение составлено на русском языке и может быть предоставлено на других языках
                            исключительно для удобства Пользователя. В случае разночтений или несоответствия перевода текста
                            Пользовательского соглашения на другой язык его версии на русском языке, преимущество имеет версия на русском языке.
                        </h2>
                        <h2 class="text-xl minimal:text-lg text-coffee font-base pb-2">
                            Пожалуйста, обратите внимание, что использование Сайта "Грузомагистр"
                            подразумевает ваше согласие с условиями настоящего Пользовательского соглашения.
                        </h2>
                    </div>
                    <h2 class="tablet:text-2xl minimal:text-xl text-coffee font-big tablet:pt-10 minimal:pt-4">Дата публикации: 06.06.2024</h2>
                </div>
            </div>
        </div>
    </div>
</x-guest-layout>